package com.cathay.test.config;

import java.util.*;

public class TestDataConfig {
    public static final Map<String, List<String>> CITY_DISTRICT_MAP = new LinkedHashMap<>();

    static {
        CITY_DISTRICT_MAP.put("基隆市", Arrays.asList("不分區"));
        CITY_DISTRICT_MAP.put("台北市", Arrays.asList("士林區", "大同區", "大安區", "中山區", "中正區", "內湖區", "文山區", "北投區", "松山區", "信義區", "南港區", "萬華區"));
        CITY_DISTRICT_MAP.put("新北市", Arrays.asList("八里區", "三芝區", "三重區", "三峽區", "土城區", "中和區", "五股區", "平溪區", "永和區", "石門區", "石碇區", "汐止區", "坪林區", "板橋區", "林口區", "金山區", "泰山區", "烏來區", "貢寮區", "淡水區", "深坑區", "新店區", "新莊區", "瑞芳區", "萬里區", "樹林區", "雙溪區", "蘆洲區", "鶯歌區"));
        CITY_DISTRICT_MAP.put("桃園縣", Arrays.asList("八德市", "大園鄉", "大溪鎮", "中壢市", "平鎮市", "桃園市", "復興鄉", "新屋鄉", "楊梅鎮", "龍潭鄉", "龜山鄉", "蘆竹市", "觀音鄉"));
        CITY_DISTRICT_MAP.put("新竹市", Arrays.asList("不分區"));
        CITY_DISTRICT_MAP.put("新竹縣", Arrays.asList("五峰鄉", "北埔鄉", "尖石鄉", "竹北市", "竹東鎮", "芎林鄉", "峨眉鄉", "湖口鄉", "新埔鄉", "新豐鄉", "橫山鄉", "關西鎮", "寶山鄉"));
        CITY_DISTRICT_MAP.put("苗栗縣", Arrays.asList("三義鄉", "三灣鄉", "大湖鄉", "公館鄉", "竹南鎮", "西湖鄉", "卓蘭鎮", "南庄鄉", "後龍鎮", "苑裡鎮", "苗栗市", "泰安鄉", "通霄鎮", "造橋鄉", "獅潭鄉", "銅鑼鄉", "頭份鎮", "頭屋鄉"));
        CITY_DISTRICT_MAP.put("台中市", Arrays.asList("大甲區", "大安區", "大肚區", "大里區", "大雅區", "中區", "太平區", "北屯區", "北區", "外埔區", "石岡區", "后里區", "西屯區", "西區", "沙鹿區", "和平區", "東區", "東勢區", "南屯區", "南區", "烏日區", "神岡區", "梧棲區", "清水區", "新社區", "潭子區", "龍井區", "豐原區", "霧峰區"));
        CITY_DISTRICT_MAP.put("彰化縣", Arrays.asList("二水鄉", "二林鎮", "大城鄉", "大村鄉", "北斗鎮", "永靖鄉", "田中鎮", "田尾鄉", "竹塘鄉", "伸港鄉", "秀水鄉", "和美鎮", "社頭鄉", "芬園鄉", "花壇鄉", "芳苑鄉", "員林鎮", "埔心鄉", "埔鹽鄉", "埤頭鄉", "鹿港鎮", "溪洲鄉", "溪湖鎮", "彰化市", "福興鄉", "線西鄉"));
        CITY_DISTRICT_MAP.put("南投縣", Arrays.asList("中寮鄉", "仁愛鄉", "水里鄉", "名間鄉", "竹山鎮", "信義鄉", "南投市", "埔里鎮", "草屯鎮", "國姓鄉", "魚池鄉", "鹿谷鄉", "集集鎮"));
        CITY_DISTRICT_MAP.put("雲林縣", Arrays.asList("斗六市", "其他"));
        CITY_DISTRICT_MAP.put("嘉義市", Arrays.asList("東區", "西區"));
        CITY_DISTRICT_MAP.put("嘉義縣", Arrays.asList("布袋鎮", "梅山鄉", "義竹鄉", "竹崎鄉", "溪口鄉", "大林鎮", "新港鄉", "中埔鄉", "朴子市", "水上鄉", "太保市", "鹿草鄉", "六腳鄉", "民雄鄉", "大埔鄉", "東石鄉", "阿里山鄉", "番路鄉"));
        CITY_DISTRICT_MAP.put("台南市", Arrays.asList("七股區", "下營區", "大內區", "山上區", "中西區", "仁德區", "六甲區", "北門區", "北區", "左鎮區", "永康區", "玉井區", "白河區", "安平區", "安定區", "安南區", "西港區", "佳里區", "官田區", "東山區", "東區", "南化區", "南區", "後壁區", "柳營區", "將軍區", "麻豆區", "善化區", "新化區", "新市區", "新營區", "楠西區", "學甲區", "龍崎區", "歸仁區", "關廟區", "鹽水區"));
        CITY_DISTRICT_MAP.put("高雄市", Arrays.asList("三民區", "大社區", "大寮區", "大樹區", "小港區", "仁武區", "內門區", "六龜區", "左營區", "永安區", "田寮區", "甲仙區", "杉林區", "那瑪夏區", "岡山區", "林園區", "阿蓮區", "前金區", "前鎮區", "美濃區", "苓雅區", "茂林區", "茄萣區", "桃源區", "梓官區", "鳥松區", "湖內區", "新興區", "楠梓區", "路竹區", "鼓山區", "旗山區", "旗津區", "鳳山區", "橋頭區", "燕巢區", "彌陀區", "鹽埕區"));
        CITY_DISTRICT_MAP.put("屏東縣", Arrays.asList("屏東市", "九如鄉", "恆春鎮", "里港鄉", "車城鄉", "高樹鄉", "枋寮鄉", "鹽埔鄉", "新園鄉", "長治鄉", "佳冬鄉", "麟洛鄉", "東港鎮", "萬丹鄉", "林邊鄉", "內埔鄉", "新埤鄉", "萬巒鄉", "潮州鎮", "崁頂鄉", "南州鄉", "竹田鄉", "琉球鄉", "滿洲鄉", "霧台鄉", "牡丹鄉", "瑪家鄉", "獅子鄉", "泰武鄉", "春日鄉", "來義鄉", "枋山鄉", "三地門鄉"));
        CITY_DISTRICT_MAP.put("宜蘭縣", Arrays.asList("羅東鎮", "宜蘭市", "礁溪鄉", "蘇澳鎮", "五結鄉", "冬山鄉", "頭城鎮", "壯圍鄉", "員山鄉", "三星鄉", "大同鄉", "南澳鄉"));
        CITY_DISTRICT_MAP.put("台東縣", Arrays.asList("台東市", "綠島鄉", "達仁鄉", "蘭嶼鄉", "大武鄉", "延平鄉", "金峰鄉", "卑南鄉", "長濱鄉", "鹿野鄉", "成功鎮", "關山鎮", "東河鄉", "海端鄉", "池上鄉", "太麻里鄉"));
        CITY_DISTRICT_MAP.put("澎湖縣", Arrays.asList("不分區"));
        CITY_DISTRICT_MAP.put("金門縣", Arrays.asList("不分區"));
    }
}